Revit 2026 API

# RebarBendingDetailResetTagRelativePosition Method

---

Resets the embedded tag position w.r.t. the realistic bending detail element to the selected tag position.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void ResetTagRelativePosition(
	Element bendingDetail
)
```
```vb
Public Shared Sub ResetTagRelativePosition (
	bendingDetail As Element
)
```
```cpp
public:
static void ResetTagRelativePosition(
	Element^ bendingDetail
)
```
```fsharp
static member ResetTagRelativePosition :
        bendingDetail : Element -> unit
```

#### Parameters

bendingDetail Element
     The bending detail element.

| Exception | Condition |
| --- | --- |
| ArgumentException | This option is only available for realistic bending detail elements. |
| ArgumentNullException | A non-optional argument was null |

This function is exclusive to realistic bending detail mode.

#### Reference

RebarBendingDetail Class

Autodesk.Revit.DB.Structure Namespace